# -*- coding: utf-8 -*-
"""
Created on Sun Feb  6 19:23:24 2022

@author: asarlybayev
"""
def day_sklon(k):
    day_sklon = {0: "",
                 1: "первый",
                 2: "второй",
                 3: "третий",
                 4: "четвертый",
                 5: "пятый",
                 6: "шестой",
                 7: "седьмой",
                 8: "восьмой",
                 9: "девятый",
                 10: "десятый",
                 11: "одинадцатый",
                 12: "двенадцатый",
                 13: "тринадцатый",
                 14: "четырнадцатый",
                 15: "пятнадцатый",
                 16: "шестнадцатый",
                 17: "семнадцатый",
                 18: "восемнадцатый",
                 19: "девятнадцатый",
                 20: "двадцатый",
                 30: "тридцатый",
                 40: "сороковой",
                 50: "пятидесятый",
                 60: "шестидесятый",
                 70: "семидесятый",
                 80: "восьмидесятый",
                 90: "девяностый",
                 100: "сотый",
                 200: "двухсотый",
                 300: "трехсотый",
                 400: "четырехсотый",
                 500: "пятисотый",
                 600: "шестисотый",
                 700: "семисотый",
                 800: "восьмиосотый",
                 900: "девятисотый",
                 1000: "тысячный"}
    desyatki = {0: "",
                2: "двадцать",
                3: "тридцать",
                4: "сорок",
                5: "пятьдесят",
                6: "шестьдесят",
                7: "семьдесят",
                8: "восемьдесят",
                9: "девяносто"}
    sotni = {0: "",
             1: "сто",
             2: "двести",
             3: "триста",
             4: "четыреста",
             5: "пятьсот",
             6: "шестьсот",
             7: "семьсот",
             8: "восемьсот",
             9: "девятьсот",
             10: "тысяча"}
    if (k < 20) or (k % 10 == 0 and k // 100 == 0) or (k % 100 == 0) or (k == 1000):
        return day_sklon[k]
    elif k>20 and k<100:
        ed = k % 10
        des = k // 10
        return desyatki[des] + " " + day_sklon[ed]
    elif (k % 100 < 20 and k < 1095 and k > 20):
        ed = k % 100
        sot = k // 100
        return sotni[sot] + " " + day_sklon[ed]
    elif (k % 10 == 0 and k % 100 > 0 and k <1095):
        ed = k % 100
        sot = k // 100
        return sotni[sot] + " " + day_sklon[ed]
    elif (k % 100 > 20 and k < 1095):
        ed = k % 10
        des = (k % 100) // 10
        sot = k // 100
        return sotni[sot] + " " + desyatki[des] + " " + day_sklon[ed]
    else:
        return "больше 3х лет уже бегаешь, какая разница какой"


a = input('Введите результат за первый день: ')
i = 0
while i < len(a):
    if a[i] in '1234567890,.':
        i += 1
    else:
        i = 0
        a = input('Вы ввели не число, введите сколько километров бежал спортсмен за первый день: ')
if i == len(a):
    a = float(a.replace(',','.'))
    i = 0
    b = input('Введите желаемый результат: ')
    while i < len(b):
        if b[i] in '1234567890,.':
            i += 1
        else:
            i = 0
            b = input('Вы ввели не число, введите желаемый результат: ')
if i == len(b):
    b = float(b.replace(',','.'))
    i = 1
    while a < b and i < 1095:
        print(f'На {day_sklon(i)} день результат {a:.1f} км')
        a = a * 1.1
        i = i + 1
    print(f'Вы достигли результата не менее {b:.1f} километров на {day_sklon(i)} день')